{
    "components": [
        {
            "path": "IBackdropHost.cs",
            "description": "Interface for ViewModels that support backdrop overlay visibility. Implements INotifyPropertyChanged for XAML binding."
        },
        {
            "path": "BackdropHostMixin.cs",
            "description": "Helper class to reduce boilerplate for IBackdropHost implementation. Provides backdrop visibility state management with property change notification."
        },
        {
            "path": "TextBoxHelper.cs",
            "description": "Attached properties for TextBox placeholder text support. Enables placeholder display without custom control templates."
        },
        {
            "path": "Toast/",
            "description": "Toast notification component."
        },
        {
            "path": "StateChip.xaml",
            "description": "Reusable chip control for displaying state/type information with customizable colors. Supports Text, ChipBackground, and ChipForeground dependency properties. Used with ComponentStateToBackgroundConverter, ComponentStateToForegroundConverter, HardwareLayerToBackgroundConverter, and HardwareLayerToForegroundConverter for enum-based styling."
        },
        {
            "path": "ContextMenu/",
            "description": "Custom context menu component with nested sub-menu support (max depth 4), animated chevrons, section dividers, and intelligent screen-boundary-aware positioning. Includes CustomContextMenuItem model, ContextMenuPositionHelper for placement calculation, and ContextMenuService for easy fluent-API-based invocation."
        },
        {
            "path": "FileDropZone.xaml",
            "description": "Reusable file drop zone component supporting drag-and-drop and click-to-upload. Provides LabelText, Documents (ObservableCollection<string>), and IsEditable dependency properties. Built-in file extension filtering for PDF, PPT, PPTX, MD, and DRAWIO formats."
        },
        {
            "path": "ConfirmDialog.xaml",
            "description": "Generic confirmation dialog for various confirmation operations. Customizable Title, Subtitle (optional), Description (multiline), ConfirmationKeyword, ConfirmText, and CancelText. Requires user to type the confirmation keyword to confirm. Returns IsConfirmed boolean via DialogResult."
        },
        {
            "path": "Spinner/",
            "description": "Global loading spinner overlay component. Includes LoadingSpinnerService singleton with Show()/Hide() methods for async operation indication, and LoadingSpinnerOverlay with rotation and fade animations."
        },
        {
            "path": "EllipsisButton.xaml",
            "description": "Reusable ellipsis (three dots) button for 'more options' actions. Exposes Click routed event for parent component binding. Used in context menu triggers and overflow menus."
        }
    ]
}